Revit 2015 API
MaterialSet.Insert Method
Insert the specified material into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	Material item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Material _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Material^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Material
The material to be inserted into the set.
Return Value
Returns whether the material was inserted into the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace